---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainer.ClearItems
source: html/4ba16a7e-eaaf-510b-2527-ce32948972bc.htm
---
# Autodesk.Revit.DB.Structure.RebarContainer.ClearItems Method

Clears all the Items stored in this Rebar Container element.

## Syntax (C#)
```csharp
public void ClearItems()
```